# WireType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..WireType Property
ElectricalSystem Class See Also
---
The wire type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public WireType WireType { get; set; }
```

Visual Basic
---
```text
Public Property WireType As WireType
	Get
	Set
```

Visual C++
---
```text
public:
property WireType^ WireType {
	WireType^ get ();
	void set (WireType^ value);
}
```

# Remarks
This property is used to retrieve the wire type of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace